use pc;

begin transaction;

-- 2.1. Използвайки две INSERT заявки, съхранете в базата от
-- данни факта, че персонален компютър модел 1100 е
-- направен от производител C, има процесор 2400 MHz,
-- RAM 2048 MB, твърд диск 500 GB, 52x DVD устройство и струва $299. 
-- Нека новият компютър има код 12. Забележка: моделът и CD са от тип
-- низ.
-- Упътване: самото вмъкване на данни е очевидно как ще стане,
-- помислете в какъв ред е по-логично да са двете заявки.

insert into product(maker,model, type)
values('C', '1100', 'PC')
insert into pc(code, model, speed, ram, hd, cd, price)
values(12, '1100', 2400, 2048, 500, '52x',299);


-- 2.2. Да се изтрие всичката налична информация за компютри модел 1100.
delete from pc where model ='1100';
delete from product where model = '1100';

-- 2.3. За всеки персонален компютър се продава и 15-инчов лаптоп със същите параметри,
-- но с $500 по-скъп. Кодът на такъв лаптоп е със 100 по-голям от кода на съответния
-- компютър. Добавете тази информация в базата.

-- ако искаме да сме съвсем точни (въпреки че в момента не е нужно),
-- трябва да добавим моделите в Product.
-- Нека производителят на тези лаптопи се казва 'Z'.

insert into product (model, maker, type)
select distinct model, 'Z', 'Laptop'
from pc;

-- ето това е очакваното решение на задачата:
insert into laptop(code, model, speed, ram, hd, price, screen)
select code+100, model, speed, ram, hd, price+500, 15
from pc;


-- 2.4. Да се изтрият всички лаптопи, направени от производител, който не
-- произвежда принтери.
-- Упътване: Мислете си, че решавате задача от познат тип - "Да се
-- изведат всички лаптопи, ...". Накрая ще е нужна съвсем малка
-- промяна. Ако започнете директно да триете, много е вероятно при
-- някой грешен опит да изтриете всички лаптопи и ще трябва често да
-- възстановявате таблицата или да работите на сляпо.

delete from laptop
where model in (select model from product
				where type ='Laptop' and maker not in 
					(select maker from product where type='Printer'));

-- 2.5. Производител А купува производител B. На всички продукти на В
-- променете производителя да бъде А.

update product
set maker = 'A' where maker='B';

-- 2.6. Да се намали два пъти цената на всеки компютър и да се добавят по
-- 20 GB към всеки твърд диск. Упътване: няма нужда от две отделни заявки.
update pc
set price=price/2, hd = hd + 20;

-- 2.7. За всеки лаптоп от производител B добавете по един инч към диагонала
-- на екрана.

update laptop
set screen = screen + 1
where model in (select model from product where maker ='B')

rollback